# ===============================================================================
# 変数
# -------------------------------------------------------------------------------
# 命名可能
# ===============================================================================
value1 = 123
_value1 = 123
test_value = 123
TEST_VALUE = 123

# ===============================================================================
# 定数
# -------------------------------------------------------------------------------
# Python では定数はサポートされていない
# 慣習的に大文字で命名することが多い
# ===============================================================================
PI = 3.14
MAX_BUFFER_SIZE = 1024


# ===============================================================================
# ドキュメントストリング(__doc__)
# -------------------------------------------------------------------------------
# モジュールの冒頭、クラスの冒頭、関数の先頭に三重クォート """...""" で記述したコメントは、
# ドキュメントストリング と呼ばれ、モジュールオブジェクト、クラスオブジェクト、関数オブジェクトの
# __doc__ アトリビュートで参照することができます。
# ドキュメントストリングはまた、対話モードで使用される help() でも参照されます。
# ===============================================================================
"""A sample module"""


class MyClass:
    """A sample class"""

    def myfunc(self, x, y):
        """A sample function"""
        return x + y


import var_const

print(var_const.__doc__)  # => A sample module
print(var_const.MyClass.__doc__)  # => A sample class
print(var_const.MyClass.myfunc.__doc__)  # => A sample function
